#MINI PROJEK C[TANTANGAN]

In [2]:
import pandas as pd
import numpy as np

In [7]:
#Mencari Batas Bawah 
i = 0.26667
j =[]
while i <= 2:
  i = i + 0.33333
  j.append(i)
print(j)

[0.6000000000000001, 0.9333300000000001, 1.2666600000000001, 1.59999, 1.9333200000000001, 2.2666500000000003]

In [13]:
#Mencari Batas Atas
x=0.6
y=[]
while x < 2.5:
  x = x + 0.33333
  y.append(x)

y[5] = 2.60000
print(y)

[0.93333, 1.26666, 1.59999, 1.9333200000000001, 2.2666500000000003, 2.6]

In [20]:
#Nilai tengah 
r = np.add(j,y)
s = r/2
s

array([0.766665, 1.099995, 1.433325, 1.766655, 2.099985, 2.433325])

In [26]:
list1 = ["U1","U2","U3","U4","U5","U6" ]
dict1 = {"Nama Kelas":list1,  "Batas Bawah":j, "Batas Atas":y, "Nilai Tengah":s}
df = pd.DataFrame(dict1)
df

  Nama Kelas  Batas Bawah  Batas Atas  Nilai Tengah
0         U1      0.60000     0.93333      0.766665
1         U2      0.93333     1.26666      1.099995
2         U3      1.26666     1.59999      1.433325
3         U4      1.59999     1.93332      1.766655
4         U5      1.93332     2.26665      2.099985
5         U6      2.26665     2.60000      2.433325